const masTitle = [
  {
    id: 0,
    title: 'Имя',
    placeholder:
      'Какой полный и сокращенный вариант? Есть ли в нем скрытый смысл? Кто так назвал персонажа и почему? Как персонаж относится к своему имени?',
  },
  {
    id: 1,
    title: 'Прозвище',
    placeholder: 'Есть ли оно? Откуда взялось? Кто так называет персонажа?',
  },
  {
    id: 2,
    title: 'Краткое описание',
  },
  {
    id: 3,
    title: 'Роль в истории',
    placeholder: 'Например, протагонист/антагонист',
  },
  {
    id: 4,
    title: 'Голос',
    placeholder: 'Как он звучит? Есть ли акцент и какой он? Какая манера речи?',
  },
  {
    id: 5,
    title: 'Возраст',
    placeholder: 'Сколько лет на момент основных событий истории? Когда родился?',
  },
  {
    id: 6,
    title: 'Пол и гендер',
  },
  {
    id: 7,
    title: 'Раса',
    placeholder: 'Например, человек, эльф, оборотень, хуманизация и т.д. Можно указать национальность',
  },
  {
    id: 8,
    title: 'Место рождения',
    placeholder: 'Где и как родился? Где жил на момент младенчества/детства? Что чувствует к этому месту?',
  },
  {
    id: 9,
    title: 'Место проживания',
    placeholder: 'Где на момент истории проживает? Почему?',
  },
  {
    id: 10,
    title: 'Профессия',
    placeholder:
      'Работает ли? Кем и почему именно им? Какой у него график? Как относится к своей работе? Доволен ли зарплатой? Какие отношения с коллегами, начальником и подчиненными?',
  },
  {
    id: 11,
    title: 'Образование',
    placeholder:
      'Учится или учился ли вообще? Как, где и почему? Легко или тяжело ему это давалось? Какой у него уровень образования?',
  },
  {
    id: 12,
    title: 'Финансовое состояние',
    placeholder:
      'Какой у него достаток? Можно ли назвать персонажа бедным или богатым? Откуда сформировалось его финансовое состояние (например, заработал своим трудом, украл, выйграл в лотерее, получил в наследство и т.д.)? Как он к нему относится (беспокоится и дорожит ли он своим финансовым положением?) и что с ним делает (например, выживает, занимается благотворительностью или копит на свою мечту)?',
  },
];

export default masTitle;
