const masTitle = [
  {
    id: 0,
    title: 'Структура семьи',
    placeholder: 'Кто входит в семью и кем они для него являются?',
  },
  {
    id: 1,
    title: 'Отношения в семье',
    placeholder: 'Какие отношения между членами семьи? Можно ли назвать семью благополучной или неблагополучной?',
  },
  {
    id: 2,
    title: 'Отношения с родителями',
  },
  {
    id: 3,
    title: 'Отношения с братьями/сестрами',
  },
  {
    id: 4,
    title: 'Отношения с детьми',
  },
  {
    id: 5,
    title: 'Отношения с другими родственниками',
  },
  {
    id: 6,
    title: 'Брак',
    placeholder:
      'Состоит ли в браке? С кем? Как и почему? Какие отношения между супругами? Ценит ли этот брак и данную концепцию в целом?',
  },
  {
    id: 7,
    title: 'Романтические отношения',
    placeholder:
      'Состоит ли в отношениях? С кем? Как и почему? Какие отношения с партнером? Ценит ли эти отношения и данную концепцию в целом?',
  },
  {
    id: 8,
    title: 'Бывшие отношения',
    placeholder:
      'Есть ли бывшие? Состоял ли раньше в отношениях/браке? Какие были отношения с тогдашним партнером? Что послужило причиной расставания? Какие отношения/память между бывшими партнерами на момент истории?',
  },
  {
    id: 9,
    title: 'Отношения с соседями',
  },
  {
    id: 10,
    title: 'Отношения с друзьями',
  },
  {
    id: 11,
    title: 'Отношения с одноклассниками/одногруппниками/коллегами',
  },
  {
    id: 12,
    title: 'Отношения с врагами',
  },
];

export default masTitle;
