const masTitle = [
  {
    id: 0,
    title: 'Название',
  },
  {
    id: 1,
    title: 'Аннотация',
    placeholder:
      'Краткое описание, которое дает представление о произведении, рассказывает завязку сюжета и общую тему',
  },
  {
    id: 2,
    title: 'Жанр',
  },
  {
    id: 3,
    title: 'Синопсис',
    placeholder: 'Краткое изложение сюжета, без подробностей, из нескольких предложений',
  },
  {
    id: 4,
    title: 'Фабула',
    placeholder: 'Описание событий в логическом и хронологическом порядке',
  },
];

export default masTitle;
