const masTitle = [
  {
    key: 'name',
    title: 'Название',
    placeholder:
      'Название произведения (книги, фильма, игры, пьессы или т.п.). Должно быть лаконичным, оригинальным, отражать суть произведения, сохранять интригу и соответсвовать жанру',
    removable: true,
  },
  {
    key: 'author',
    title: 'Автор',
    placeholder: 'За чьим авторством создано произведение (ФИО/псевдоним)',
  },
  {
    key: 'annotation',
    title: 'Аннотация',
    placeholder:
      'Краткое описание, которое дает представление о произведении, рассказывает завязку сюжета и общую тему',
  },
  {
    key: 'genre',
    title: 'Жанр',
  },
  {
    key: 'synopsis',
    title: 'Синопсис',
    placeholder: 'Краткое изложение сюжета, без подробностей, из нескольких предложений',
  },
  {
    key: 'fabula',
    title: 'Фабула',
    placeholder: 'Описание событий в логическом и хронологическом порядке',
  },
  {
    key: 'setting',
    title: 'Сеттинг',
    placeholder: 'Описание места, времени и социального контекста, в которых происходит сюжет',
  },
];

export default masTitle;
