const masTitle = [
  {
    key: 'height',
    title: 'Рост',
    placeholder:
      'Какой рост? Есть ли комплексы/травля/неудобства по этому поводу? Есть ли заболевания, связанные с ростом?',
  },
  {
    key: 'weight',
    title: 'Вес',
    placeholder:
      'Какой вес? Есть ли комплексы/травля/неудобства по этому поводу? Есть ли заболевания, связанные с весом?',
  },
  {
    key: 'build',
    title: 'Телосложение',
    placeholder:
      'Какое телосложение/фигура? Какие есть особенности в них? Есть ли комплексы/травля/неудобства по этому поводу? Есть ли заболевания, связанные телосложением/фигурой?',
  },
  {
    key: 'facialFeatures',
    title: 'Черты лица',
    placeholder:
      'Какие черты лица и какие особенности в нем? Т.е. какие лоб, брови, переносица, нос, глаза, щеки, уши, скулы, фильтрум (губной желобок), губы, рот и подбородок?',
  },
  {
    key: 'hairColor',
    title: 'Волосы',
    placeholder:
      'Какой длины, цвета и текстуры волосы? Какая стрижка/прическа? Красит ли волосы? Ухаживает ли за ними?',
  },
  {
    key: 'eyeColor',
    title: 'Глаза',
    placeholder:
      'Наличие и количество глаз. Какого цвета и формы глаза? Какие ресницы и зрачек? Какое зрение? Есть ли заболевания или травмы, связанные с глазами? Носит ли очки или линзы?',
  },
  {
    key: 'dominantHand',
    title: 'Ведущая рука',
    placeholder: 'Например, левша, правша, амбидекстер. Есть ли какая-нибудь особенная причина этому?',
  },
  {
    key: 'attractiveFeatures',
    title: 'Привлекательные элементы внешности',
    placeholder: 'Что привлекательного во внешности персонажа?',
  },
  {
    key: 'unattractiveFeatures',
    title: 'Непривлекательные элементы внешности',
    placeholder: 'Что непривлекательного во внешности персонажа?',
  },
  {
    key: 'distinguishingFeatures',
    title: 'Отличительные черты и особенности внешности',
    placeholder: 'Например, шрамы, татуировки, родинки, веснушки, острые зубы, когти и т.д.',
  },
  {
    key: 'clothing',
    title: 'Одежда',
    placeholder:
      'Как обычно одевается? Как официально одевается? Какой стиль, цвета, ткани, элементы одежды, бренды предпочитает и почему?',
  },
  {
    key: 'accessories',
    title: 'Аксессуары',
    placeholder:
      'Носит ли какие-нибудь аксессуары? Например, кольца, серьги, монокль, рюкзак, ободок с ушками, наушники и т.д.',
  },
];

export default masTitle;
