export const masTitleCharacter = [
  {
    key: 'name',
    title: 'Имя',
    placeholder:
      'Какое официальное полное имя? Кто и почему назвал так персонажа? Как персонаж относится к своему имени? Есть ли значение у имени? Какие есть сокращенные варианты? Как представится незнакокомцу? Как попросит себя называть?',
    removable: true,
  },
  {
    key: 'nickname',
    title: 'Прозвище',
    placeholder:
      'Есть ли прозвище? Кто и почему так зовет персонажа? Есть ли значение у прозвища или история, связанная с ним? Как персонаж относится к своему прозвищу?',
  },
  {
    key: 'description',
    title: 'Краткое описание',
    placeholder:
      'Охарактерезуйте персонажа парой предложений о самом важном для сюжета (кто он, откуда, чем будет заниматься по ходу повествования и т.д. Например: "Англичанин, пытающийся отреставрировать родительский особняк и получить опеку над осиротевшим соседским мальчиком")',
  },
  {
    key: 'role',
    title: 'Роль',
    placeholder:
      'Какую роль играет в произведении? Например, главный герой, фоновый персонаж, антагонист, друг протагониста или т.п.',
  },
  {
    key: 'gender',
    title: 'Пол/Гендер',
    placeholder: 'Какой биологичекий пол и какая гендерная идентичность?',
  },
  {
    key: 'age',
    title: 'Возраст',
    placeholder: 'Сколько лет на начало истории?',
  },
  {
    key: 'race',
    title: 'Раса',
    placeholder: 'Например, человек, вампир, оборотень, эльф, хуманизация и т.п. Можно указать национальность',
  },
  {
    key: 'voice',
    title: 'Голос',
    placeholder:
      'Опишите голос и как он звучит. Какая манера речи и темп? Есть ли акцент? Нарушения речи? Как звучит, когда испытывает яркие эмоции: печаль, восторг, ужас и т.д.?',
  },
  {
    key: 'birthplace',
    title: 'Рождение',
    placeholder:
      'Где, как и когда родился? При каких обстоятельствах? Где жил на момент младенчества/детства? Что чувствует к этому месту?',
  },
  {
    key: 'residence',
    title: 'Место жительства',
    placeholder:
      'Где проживает в начале и ходе истории (страна, город, улица, дом, квартира и т.п. Все данные об адресе, которые могут быть использованы в произведении)? Как так получилось, что персонаж живет именно здесь (получил дом в наследство, переехал из-за нового места учебы/работы и т.п.? Нравится ли ему здесь?',
  },
  {
    key: 'occupation',
    title: 'Профессия',
    placeholder:
      'Кем работает и работает ли? Как выбрал такое направление деятельности и почему? Доволен ли работой и насколько отвественно и качественно выполняет ее? Какой у него график? Ориентирован ли на карьеру? Волнует ли она его? Какие отношения с коллегами, начальником и подчиненными?',
  },
  {
    key: 'educationLevel',
    title: 'Образование',
    placeholder:
      'Учился ли или учится ли? Где? Насколько успешно и с удовольствием ли? Какой уровень образования? Легко или трудно дается учеба? Волнует ли его образование/образованность? Как относится к персонажам с противоположным уровнем образования/образованности?',
  },
  {
    key: 'financialStatus',
    title: 'Финансовое состояние',
    placeholder:
      'Какой имеет достаток? Можно ли назвать персонажа богатым или бедным? Чем зарабатывает и как оказался в таком материальном положении (выиграл в латерею, получил наследство, усердно работал, копил несколько лет, воровал, залез в долги и т.п.)? Волнует ли его финансовое благополуние? Как относится к персонажам, которые находятся в противоположном финансовом положении? На что тратит свое состояние (выживает, путешествует, занимается благотворительностью, копит на мечту и т.д.)?',
  },
];

export const masTitleCharacterAppearance = [
  {
    key: 'height',
    title: 'Рост',
    placeholder:
      'Какой рост? Есть ли комплексы/травля/неудобства по этому поводу? Есть ли заболевания, связанные с ростом?',
  },
  {
    key: 'weight',
    title: 'Вес',
    placeholder:
      'Какой вес? Есть ли комплексы/травля/неудобства по этому поводу? Есть ли заболевания, связанные с весом?',
  },
  {
    key: 'build',
    title: 'Телосложение',
    placeholder:
      'Какое телосложение/фигура? Какие есть особенности в них? Есть ли комплексы/травля/неудобства по этому поводу? Есть ли заболевания, связанные телосложением/фигурой',
  },
  {
    key: 'facialFeatures',
    title: 'Черты лица',
    placeholder:
      'Какие черты лица и какие особенности в нем? Т.е. какие лоб, брови, переносица, нос, глаза, щеки, уши, скулы, фильтрум (губной желобок), губы, рот и подбородок?',
  },
  {
    key: 'hairColor',
    title: 'Волосы',
    placeholder:
      'Какой длины, цвета, текстуры и структуры волосы? Какая стрижка/прическа? Красит ли волосы? Ухаживает ли за ними?',
  },
  {
    key: 'eyeColor',
    title: 'Глаза',
    placeholder:
      'Наличие/отсутствие глаз. Какого цвета радужка и белок? Какой формы глаза? Какие ресницы и зрачек? Какое зрение? Есть ли заболевания или травмы, связанные с глазами? Носит ли очки или линзы?',
  },
  {
    key: 'dominantHand',
    title: 'Ведущая рука',
    placeholder: 'Например, левша, правша, амбидекстер. Есть ли какая-нибудь особенная причина этому?',
  },
  {
    key: 'attractiveFeatures',
    title: 'Привлекательные элементы внешности',
    placeholder: 'Что привлекательного во внешности персонажа?',
  },
  {
    key: 'unattractiveFeatures',
    title: 'Непривлекательные элементы внешности',
    placeholder: 'Что непривлекательного во внешности персонажа?',
  },
  {
    key: 'distinguishingFeatures',
    title: 'Отличительные черты/особенности внешности',
    placeholder: 'Например, шрамы, татуировки, родинки, веснушки, острые зубы, когти, отсутствие руки и т.д.',
  },
  {
    key: 'clothing',
    title: 'Одежда',
    placeholder:
      'Как обычно одевается? Как официально одевается? Какой стиль, цвета, ткани, элементы одежды, бренды предпочитает и почему?',
  },
  {
    key: 'accessouries',
    title: 'Аксессуары',
    placeholder:
      'Носит ли какие-нибудь аксессуары? Например, кольца, серьги, монокль, рюкзак, ободок с ушками, наушники и т.д.',
  },
];

export const masTitleCharacterPersonality = [
  {
    key: 'personality',
    title: 'Личность/характер',
    placeholder: 'Общая характеристика личности/характера',
  },
  {
    key: 'selfEsteem',
    title: 'Самооценка',
    placeholder: 'Какая самооценка и что на это повлияло? Здраво ли персонаж себя оценивает?',
  },
  {
    key: 'upbringing',
    title: 'Воспитание',
    placeholder: 'При каком воспитании вырос? Кто занимался воспитанием? Какое влияние это оказало?',
  },
  {
    key: 'socialBehavior',
    title: 'Поведение в обществе',
    placeholder: 'Как ведет себя? Отличается ли его поведение наедине с собой, с близкими и в обществе?',
  },
  {
    key: 'sociability',
    title: 'Общительность',
    placeholder:
      'Какой уровень общительности и социальной батареи? Нравится ли находится в обществе или ему комфортнее наедине с собой или близкими? Влияет ли на персонажа количество людей вокруг или их уровень знакомства? С кем ему легче всего общаться?',
  },
  {
    key: 'cleanliness',
    title: 'Чистоплотность',
    placeholder: 'Уровень чистоплотности и как относится к беспорядку?',
  },
  {
    key: 'gait',
    title: 'Походка',
    placeholder:
      'Как обычно ходит? Например, ссутулившись, руки в карманах и опустивши взор, вприпрыжку, с хромотой и т.д.',
  },
  {
    key: 'habits',
    title: 'Привычки',
    placeholder:
      'Какие имеет привычки, включая вредные? Например, курит, устраивает утренние пробежки, теребит косу или кусает губы, когда нервничает, и т.д.',
  },
  {
    key: 'peculiarities',
    title: 'Особенности поведения/личности',
    placeholder:
      'Что в поведении или личности выделяет среди других? Чем специфическим отличается от других персонажей?',
  },
  {
    key: 'strengths',
    title: 'Сильные стороны',
    placeholder: 'Что получается лучше всего? Что легче дается?',
  },
  {
    key: 'weaknesses',
    title: 'Слабые стороны',
    placeholder: 'Что получается хуже всего? Что тяжело дается?',
  },
  {
    key: 'complexes',
    title: 'Комплексы',
    placeholder: 'Какие комплексы, переживания и неуверенность есть и откуда они взялись?',
  },
  {
    key: 'attractiveTraits',
    title: 'Привлекательные черты характера',
    placeholder: 'Что в характере персонажа привлекает других?',
  },
  {
    key: 'unattractiveTraits',
    title: 'Непривлекательные черты характера',
    placeholder: 'Что в характере персонажа отталкивает других?',
  },
  {
    key: 'goals',
    title: 'Цели',
    placeholder: 'Какие цели в жизни? К чему стремится?',
  },
  {
    key: 'fears',
    title: 'Страхи',
    placeholder: 'Чего боится? Имеет ли фобии? Что вызвало это?',
  },
  {
    key: 'values',
    title: 'Ценности и мировозрение',
    placeholder:
      'Какие ценности и мировозрение? Почему именно такие? Отстаивает ли их? Навязывает ли их другим? Готов/может ли изменить свое виденье?',
  },
  {
    key: 'dreams',
    title: 'Мечты',
    placeholder: 'О чем мечтает? Осуществима ли мечта? Работает ли над ее реализацией?',
  },
  {
    key: 'physicalHealth',
    title: 'Состояние физического здоровья',
    placeholder:
      'Насколько здоров персонаж в физическом плане? Как часто болеет? Есть ли травмы, хронические или врожденные заболевания, аллергии и т.д.? Есть ли предрасположенности для их возникновения? Обследовался ли и следует ли лечению?',
  },
  {
    key: 'mentalHealth',
    title: 'Состояние психического здоровья',
    placeholder:
      'Насколько здоров персонаж в психическом плане? Имеет ли какие-то травмы, расстройства, врожденные или приобретенные психические заболевания? Есть ли предрасположенности для их возникновения? Обследовался ли и следует ли лечению?',
  },
  {
    key: 'attitudeToReligion',
    title: 'Отношение к религии',
    placeholder:
      'Какие имеет религиозные убеждения? Принадлежит ли к определенной системе верований, обрядов и практик? Верит ли в сверхъестественные или высшие силы? Играет ли религия важную роль в повседневной жизни персонажа, влияет ли она на его жизненные решения? Как относится к персонажам с другими релизиозными убеждениями?',
  },
  {
    key: 'attitudeToSuperstitions',
    title: 'Отношение к суевериям',
    placeholder:
      'Например, к приметам или мистике в целом. Играют ли суеверия важную роль в повседневной жизни персонажа, влияют ли они на его жизненные решения?',
  },
  {
    key: 'attitudeToPolitics',
    title: 'Отношение к политике',
    placeholder:
      'Проявляет ли интерес к политике? Какие имеет взгляды и убеждения в данной сфере? Как относится к персонажам с противоположными взглядами? Играет ли политика важную роль в повседневной жизни персонажа, влияет ли она на его жизненные решения?',
  },
  {
    key: 'attitudeToSports',
    title: 'Отношение к спорту',
    placeholder: 'Проявляет ли интерес к спорту в каком-либо виде? Что думает о нем?',
  },
  {
    key: 'attitudeToArt',
    title: 'Отношение к искусству',
    placeholder: 'Проявляет ли интерес к искусству в каком-либо виде? Что думает о нем?',
  },
  {
    key: 'tasteInLiterature',
    title: 'Вкус в литературе',
    placeholder:
      'Увлекается ли литературой? Какие жанры и авторов предпочитает, а какие отвергает? Есть ли любимая книга?',
  },
  {
    key: 'tasteInMovies',
    title: 'Вкус в кино',
    placeholder:
      'Увлекается ли фильмами/мультфильмами? Какие жанры и актеров предпочитает, а какие отвергает? Есть ли любимый фильм/актер?',
  },
  {
    key: 'tasteInMusic',
    title: 'Вкус в музыке',
    placeholder:
      'Увлекается ли музыкой? Какие жанры и исполнителей предпочитает, а какие отвергает? Есть ли любимая песня/группа?',
  },
  {
    key: 'tasteInFood',
    title: 'Вкус в еде',
    placeholder:
      'Увлекается ли кулинарией? Какую кухню и блюда предпочитает, а какую отвергает? Есть ли любимая еда/напиток?',
  },
  {
    key: 'hobbies',
    title: 'Хобби',
    placeholder:
      'Какому занятию с удовольствием уделяет свое свободное время? Почему выбрал именно его? Какую пользу от этого получает?',
  },
  {
    key: 'whatLikes',
    title: 'Что нравится',
    placeholder:
      'Например, дождливая погода, активные люди, изумруный цвет, порядок на столе, фото милых котиков и т.д.',
  },
  {
    key: 'whatDislikes',
    title: 'Что не нравится',
    placeholder:
      'Например, солнечная погода, меланхоличные люди, бордовый цвет, беспорядок в комнате, голосовые сообщения и т.д.',
  },
  {
    key: 'conflict',
    title: 'Основной конфликт',
    placeholder: 'В чем заключается конфликт персонажа в истории?',
  },
  {
    key: 'evolution',
    title: 'Жизнь до начала истории',
    placeholder:
      'Как жил и кем был персонаж до начала истории? Как прошло его детство? Какие события из прошлого оставили на нем след или важны для истории?',
  },
];

export const masTitleCharacterSocial = [
  {
    key: 'familyStructure',
    title: 'Структура семьи',
    placeholder: 'Кто входит в семью и кем они являются для персонажа?',
  },
  {
    key: 'familyRelationships',
    title: 'Отношения в семье',
    placeholder: 'Какие отношения между членами семьи? Можно ли назвать семью благополучной или неблагополучной?',
  },
  {
    key: 'relationshipWithParents',
    title: 'Отношения с родителями',
  },
  {
    key: 'relationshipWithSiblings',
    title: 'Отношения с братьями/сестрами',
  },
  {
    key: 'relationshipWithChildren',
    title: 'Отношения с детьми',
  },
  {
    key: 'relationshipOtherRelatives',
    title: 'Отношения с другими родственниками',
  },
  {
    key: 'maritalStatus',
    title: 'Брак',
    placeholder:
      'Состоит ли в браке? С кем? Как и почему? Какие отношения между супругами? Ценит ли этот брак и данную концепцию в целом?',
  },
  {
    key: 'romanticRelationships',
    title: 'Романтические отношения',
    placeholder:
      'Состоит ли в отношениях? С кем? Как и почему? Какие отношения с партнером? Ценит ли эти отношения и данную концепцию в целом?',
  },
  {
    key: 'exes',
    title: 'Бывшие отношения',
    placeholder:
      'Есть ли бывшие? Состоял ли раньше в отношениях/браке? Какие были отношения с тогдашним партнером? Что послужило причиной расставания? Какие отношения/память между бывшими партнерами на момент истории?',
  },
  {
    key: 'relationshipWithNeighbors',
    title: 'Отношения с соседями',
  },
  {
    key: 'relationshipWithFriends',
    title: 'Отношения с друзьями',
  },
  {
    key: 'relationshipWithColleagues',
    title: 'Отношения с одноклассниками/одногруппниками/коллегами по работе',
  },
  {
    key: 'relationshipWithEnemies',
    title: 'Отношения с врагами',
  },
];
