const masTitleCharacter = [
  {
    key: 'name',
    title: 'Имя',
    placeholder:
      'Какое официальное полное имя? Кто и почему назвал так персонажа? Есть ли значение у имени? Какие есть сокращенные варианты? Как представится незнакокомцу? Как попросит себя называть?',
    removable: true,
  },
  {
    key: 'nickname',
    title: 'Прозвище',
    placeholder:
      'Есть ли прозвище? Кто и почему так зовет персонажа? Есть ли значение у прозвища или история, связанная с ним? Как сам персонаж относится к прозвищу',
  },
  {
    key: 'description',
    title: 'Краткое описание',
    placeholder:
      'Охарактерезуйте персонажа парой предложений о самом важном для сюжета (кто он, откуда, чем будет заниматься по ходу повествования и т.д. Например: "Англичанин, пытающийся отреставрировать родительский особняк и получить опеку над осиротевшим соседским мальчиком")',
  },
  {
    key: 'role',
    title: 'Роль',
    placeholder:
      'Какую роль играет в произведении? Главный герой, фоновый персонаж, антагонист, друг протагониста или т.п.',
  },
  {
    key: 'gender',
    title: 'Пол/Гендер',
    placeholder: 'Какой биологичекий пол и какая гендерная идентичность?',
  },
  {
    key: 'age',
    title: 'Возраст',
    placeholder: 'Сколько лет на начало истории?',
  },
  {
    key: 'race',
    title: 'Раса',
    placeholder: 'Например, человек, вампир, оборотень, эльф, хуманизация и т.п. Можно указать национальность',
  },
  {
    key: 'voice',
    title: 'Голос',
    placeholder:
      'Опишите голос и как он звучит. Какая манера речи и темп? Есть ли акцент? Нарушения речи? Как звучит, когда испытывает яркие эмоции: печаль, восторг, ужас и т.д.?',
  },
  {
    key: 'birthplace',
    title: 'Рождение',
    placeholder: 'Где и когда родился? При каких обстоятельствах?',
  },
  {
    key: 'residence',
    title: 'Место жительства',
    placeholder:
      'Где проживает в начале и ходе истории (страна, город, улица, дом, квартира и т.п. Все данные об адресе, которые могут быть использованы в произведении)? Как так получилось, что персонаж живет именно здесь (получил дом в наследство, переехал из-за нового места учебы/работы и т.п.? Нравится ли ему здесь?',
  },
  {
    key: 'occupation',
    title: 'Профессия',
    placeholder:
      'Кем работает и работает ли? Как выбрал такое направление деятельности и почему? Доволен ли работой и насколько отвественно и качественно выполняет ее? Ориентирован ли на карьеру? Волнует ли она его?',
  },
  {
    key: 'educationLevel',
    title: 'Образование',
    placeholder:
      'Учился ли или учится ли? Где? Насколько успешно и с удовольствием ли? Какой уровень образования? Легко или трудно дается учеба? Волнует ли его образование/образованность? Как относится к персонажам с противоположным уровнем образования/образованности?',
  },
  {
    key: 'financialStatus',
    title: 'Финансовое состояние',
    placeholder:
      'Какое имеет финансовое состояние? Можно ли назвать персонажа богатым или бедным? Чем зарабатывает и как оказался в таком материальном положении (выиграл в латерею, получил наследство, копил несколько лет, воровал, обанкротился и т.п.)? Волнует ли его финансовое благополуние? Как относится к персонажам с противоположным финансовым положением?',
  },
  {
    key: 'financialStatus',
    title: 'Финансовое состояние',
    placeholder:
      'Какое имеет финансовое состояние? Можно ли назвать персонажа богатым или бедным? Чем зарабатывает и как оказался в таком материальном положении (выиграл в латерею, получил наследство, копил несколько лет, воровал, обанкротился и т.п.)? Волнует ли его финансовое благополуние? Как относится к персонажам с противоположным финансовым положением?',
  },
];

export default masTitleCharacter;
