const masTitleLocation = [
  {
    key: 'name',
    title: 'Название',
    placeholder:
      'Название места (замка, города, пещеры, леса, страны, волшебного мира и т.п.). Должно быть лаконичным и отражать суть',
    removable: true,
  },
  {
    key: 'description',
    title: 'Описание',
    placeholder: 'Краткое общее описание места, его местоположения и общей атмосферы',
  },
  {
    key: 'type',
    title: 'Тип',
    placeholder: 'Тип места (замок, город, лес, пещера, поселение или т.п.)',
  },
  {
    key: 'history',
    title: 'История',
    placeholder: 'История места, легенды и предания, связанные с ним',
  },
  {
    key: 'environment',
    title: 'Окружение',
    placeholder: 'Описание окружающей местности и погодных условий',
  },
  {
    key: 'atmosphere',
    title: 'Атмосфера',
    placeholder: 'Описание эмоционального фона и общего впечатления от места',
  },
  {
    key: 'details',
    title: 'Детали',
    placeholder: 'Характерные особенности места, детали интерьера или экстерьера, важные для сюжета мелочи',
  },
];

export default masTitleLocation;
