const masTitleObject = [
  {
    key: 'name',
    title: 'Название',
    placeholder: 'Должно отражать суть oбъекта/артефакта/памятной вещи/важного для сюжета предмета в лаконичной форме',
    removable: true,
  },
  {
    key: 'description',
    title: 'Описание',
    placeholder: 'Описание сути объекта, его значения или принципа работы',
  },
  {
    key: 'type',
    title: 'Тип',
    placeholder: 'Тип объекта (артефакт, оружие, амулет, книга, семейная реликвия или т.п.)',
  },
  {
    key: 'history',
    title: 'История',
    placeholder:
      'История создания обекта, его владельцы и как они получали объект, известные события/легенды, связанные с ним',
  },
  {
    key: 'details',
    title: 'Детали',
    placeholder:
      'Описание внешнего вида объекта и материалов, из которых он был изготовлен, его особенностей и отличительных знаков',
  },
];

export default masTitleObject;
