const masTitlPlotline = [
  {
    key: 'name',
    title: 'Название',
    placeholder: 'Должно отражать суть сюжетной линии в лаконичной форме',
    removable: true,
  },
  { key: 'description', title: 'Описание', placeholder: 'О чем сюжетная линия? Кратко' },
  {
    key: 'exposition',
    title: 'Экспозиция',
    placeholder: 'Представление основных персонажей, места, времени действия и начальных обстоятельств',
  },
  {
    key: 'plot',
    title: 'Завязка',
    placeholder: 'Начало основного конфликта, который будет развиваться на протяжении сюжета',
  },
  {
    key: 'development',
    title: 'Развитие действия',
    placeholder: 'События, которые ведут к кульминации, увеличивая напряжение и раскрывая персонажей',
  },
  {
    key: 'culmination',
    title: 'Кульминация',
    placeholder: 'Наивысшая точка напряжения, решающее событие конфликта',
  },
  {
    key: 'denouement',
    title: 'Развязка',
    placeholder: 'Решение конфликта, завершение основного сюжета линии',
  },
  {
    key: 'epilogue',
    title: 'Постпозиция/Эпилог',
    placeholder: 'Дополнительная информация о судьбах персонажей после развязки, иногда включаемая в произведение',
  },
];

export default masTitlPlotline;
